Terraform plan for __staging__
<details>
  <summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```hcl
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudfoundry_service_instance.k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "k8s_cluster" {
      + id                             = (known after apply)
      + name                           = "ssb-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "83fcf0ea-891c-4e46-8f9e-f1ab22dc040d"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "30m"
          + delete = "30m"
        }
    }

  # module.broker_solr.cloudfoundry_app.ssb will be created
  + resource "cloudfoundry_app" "ssb" {
      + buildpack                  = "binary_buildpack"
      + command                    = "source .profile && ./cloud-service-broker serve"
      + disk_quota                 = 2048
      + enable_ssh                 = false
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = 1
      + memory                     = 256
      + name                       = "ssb-solr"
      + path                       = "./app-ssb-solr.zip"
      + ports                      = (known after apply)
      + source_code_hash           = "RrwYpMoh/xKGoHOwyE8XYO3+Ef1OCBgQow1ZUZ/qeN8="
      + space                      = "5edc803e-3376-4788-b72c-a152f11925b0"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "blue-green"
      + timeout                    = 60

      + routes {
          + port  = (known after apply)
          + route = "37a0c72c-cbfb-44a3-9ccc-40b12002b80f"
        }

      + service_binding {
          + service_instance = (known after apply)
        }
      + service_binding {
          + service_instance = (known after apply)
        }
    }

  # module.broker_solr.cloudfoundry_service_broker.space_scoped_broker["gsa-datagov/management-staging"] will be created
  + resource "cloudfoundry_service_broker" "space_scoped_broker" {
      + catalog_change                   = false
      + catalog_hash                     = (known after apply)
      + fail_when_catalog_not_accessible = false
      + id                               = (known after apply)
      + name                             = "ssb-solr-gsa-datagov-management-staging"
      + password                         = (sensitive value)
      + service_plans                    = (known after apply)
      + services                         = (known after apply)
      + space                            = "5edc803e-3376-4788-b72c-a152f11925b0"
      + url                              = "https://ssb-solr-gsa-datagov-management-staging.app.cloud.gov"
      + username                         = "d99d937a-d4fb-d2e4-8986-8e77098608ba"
    }

  # module.broker_solr.cloudfoundry_service_instance.db will be created
  + resource "cloudfoundry_service_instance" "db" {
      + id                             = (known after apply)
      + name                           = "ssb-solr-db"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "3a8e624f-ba5a-4435-8fa4-ee955b103bae"
      + space                          = "5edc803e-3376-4788-b72c-a152f11925b0"
      + tags                           = [
          + "mysql",
        ]
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

Plan generated in [plan #45](https://github.com/GSA/datagov-ssb/actions/runs/702318730)